cmsis-svd/cmsis-svd/data/Atmel/ATSAMV70N20B.svd
               <register>
                  <name>XDMAC_CC</name>
                  <description>Channel Configuration Register</description>
                  <addressOffset>0x28</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>TYPE</name>
                        <description>Channel x Transfer Type</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>TYPESelect</name>
                           <enumeratedValue>
                              <name>MEM_TRAN</name>
                              <description>Self-triggered mode (memory-to-memory transfer).</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PER_TRAN</name>
                              <description>Synchronized mode (peripheral-to-memory or memory-to-peripheral transfer).</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MBSIZE</name>
                        <description>Channel x Memory Burst Size</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>MBSIZESelect</name>
                           <enumeratedValue>
                              <name>SINGLE</name>
                              <description>The memory burst size is set to one.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FOUR</name>
                              <description>The memory burst size is set to four.</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>EIGHT</name>
                              <description>The memory burst size is set to eight.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SIXTEEN</name>
                              <description>The memory burst size is set to sixteen.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DSYNC</name>
                        <description>Channel x Synchronization</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DSYNCSelect</name>
                           <enumeratedValue>
                              <name>PER2MEM</name>
                              <description>Peripheral-to-memory transfer.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MEM2PER</name>
                              <description>Memory-to-peripheral transfer.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SWREQ</name>
                        <description>Channel x Software Request Trigger</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SWREQSelect</name>
                           <enumeratedValue>
                              <name>HWR_CONNECTED</name>
                              <description>Hardware request line is connected to the peripheral request line.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SWR_CONNECTED</name>
                              <description>Software request is connected to the peripheral request line.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>MEMSET</name>
                        <description>Channel x Fill Block of memory</description>
                        <bitOffset>7</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>MEMSETSelect</name>
                           <enumeratedValue>
                              <name>NORMAL_MODE</name>
                              <description>Memset is not activated.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HW_MODE</name>
                              <description>Sets the block of memory pointed by DA field to the specified value. This operation is performed on 8-, 16- or 32-bit basis.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CSIZE</name>
                        <description>Channel x Chunk Size</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>3</bitWidth>
                        <enumeratedValues>
                           <name>CSIZESelect</name>
                           <enumeratedValue>
                              <name>CHK_1</name>
                              <description>1 data transferred</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_2</name>
                              <description>2 data transferred</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_4</name>
                              <description>4 data transferred</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_8</name>
                              <description>8 data transferred</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CHK_16</name>
                              <description>16 data transferred</description>
                              <value>0x4</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DWIDTH</name>
                        <description>Channel x Data Width</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DWIDTHSelect</name>
                           <enumeratedValue>
                              <name>BYTE</name>
                              <description>The data size is set to 8 bits</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HALFWORD</name>
                              <description>The data size is set to 16 bits</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>WORD</name>
                              <description>The data size is set to 32 bits</description>
                              <value>0x2</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SIF</name>
                        <description>Channel x Source Interface Identifier</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>SIFSelect</name>
                           <enumeratedValue>
                              <name>AHB_IF0</name>
                              <description>The data is read through the system bus interface 0.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF1</name>
                              <description>The data is read through the system bus interface 1.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DIF</name>
                        <description>Channel x Destination Interface Identifier</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DIFSelect</name>
                           <enumeratedValue>
                              <name>AHB_IF0</name>
                              <description>The data is written through the system bus interface 0.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>AHB_IF1</name>
                              <description>The data is written though the system bus interface 1.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>SAM</name>
                        <description>Channel x Source Addressing Mode</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>SAMSelect</name>
                           <enumeratedValue>
                              <name>FIXED_AM</name>
                              <description>The address remains unchanged.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCREMENTED_AM</name>
                              <description>The addressing mode is incremented (the increment size is set to the data size).</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UBS_AM</name>
                              <description>The microblock stride is added at the microblock boundary.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UBS_DS_AM</name>
                              <description>The microblock stride is added at the microblock boundary, the data stride is added at the data boundary.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DAM</name>
                        <description>Channel x Destination Addressing Mode</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>DAMSelect</name>
                           <enumeratedValue>
                              <name>FIXED_AM</name>
                              <description>The address remains unchanged.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>INCREMENTED_AM</name>
                              <description>The addressing mode is incremented (the increment size is set to the data size).</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UBS_AM</name>
                              <description>The microblock stride is added at the microblock boundary.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UBS_DS_AM</name>
                              <description>The microblock stride is added at the microblock boundary; the data stride is added at the data boundary.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>INITD</name>
                        <description>Channel Initialization Terminated (this bit is read-only)</description>
                        <bitOffset>21</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>INITDSelect</name>
                           <enumeratedValue>
                              <name>IN_PROGRESS</name>
                              <description>Channel initialization is in progress.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TERMINATED</name>
                              <description>Channel initialization is completed.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>RDIP</name>
                        <description>Read in Progress (this bit is read-only)</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>RDIPSelect</name>
                           <enumeratedValue>
                              <name>DONE</name>
                              <description>No active read transaction on the bus.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IN_PROGRESS</name>
                              <description>A read transaction is in progress.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>WRIP</name>
                        <description>Write in Progress (this bit is read-only)</description>
                        <bitOffset>23</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>WRIPSelect</name>
                           <enumeratedValue>
                              <name>DONE</name>
                              <description>No active write transaction on the bus.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>IN_PROGRESS</name>
                              <description>A write transaction is in progress.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>PERID</name>
                        <description>Channel x Peripheral Hardware Request Line Identifier</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                        <enumeratedValues>
                           <name>PERIDSelect</name>
                           <enumeratedValue>
                              <name>HSMCI</name>
                              <description>HSMCI</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI0_TX</name>
                              <description>SPI0_TX</description>
                              <value>1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>SPI0_RX</name>
                              <description>SPI0_RX</description>
                              <value>2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_TX</name>
                              <description>QSPI_TX</description>
                              <value>5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>QSPI_RX</name>
                              <description>QSPI_RX</description>
                              <value>6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART0_TX</name>
                              <description>USART0_TX</description>
                              <value>7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART0_RX</name>
                              <description>USART0_RX</description>
                              <value>8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART1_TX</name>
                              <description>USART1_TX</description>
                              <value>9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART1_RX</name>
                              <description>USART1_RX</description>
                              <value>10</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART2_TX</name>
                              <description>USART2_TX</description>
                              <value>11</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>USART2_RX</name>
                              <description>USART2_RX</description>
                              <value>12</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>PWM0</name>
                              <description>PWM0</description>
                              <value>13</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS0_TX</name>
                              <description>TWIHS0_TX</description>
                              <value>14</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS0_RX</name>
                              <description>TWIHS0_RX</description>
                              <value>15</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS1_TX</name>
                              <description>TWIHS1_TX</description>
                              <value>16</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS1_RX</name>
                              <description>TWIHS1_RX</description>
                              <value>17</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS2_TX</name>
                              <description>TWIHS2_TX</description>
                              <value>18</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>TWIHS2_RX</name>
                              <description>TWIHS2_RX</description>
                              <value>19</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART0_TX</name>
                              <description>UART0_TX</description>
                              <value>20</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART0_RX</name>
                              <description>UART0_RX</description>
                              <value>21</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART1_TX</name>
                              <description>UART1_TX</description>
                              <value>22</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART1_RX</name>
                              <description>UART1_RX</description>
                              <value>23</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART2_TX</name>
                              <description>UART2_TX</description>
                              <value>24</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UART2_RX</name>
                              <description>UART2_RX</description>
                              <value>25</value>
                           </enumeratedValue>
                           <enumeratedValue>
